Repository: Sasha20101989/Production-Supply-System
Catalog: production-supply-system.BLL/Properties/Resources.*.resx
Languages: ru_ru

# CheckingProgress
source: checking {0} from {1} lines
ru_ru: проверка {0} из {1} строк

# ContainerTypeMissing
source: container '{0}' is missing container type information
ru_ru: для контейнера '{0}' отсутствует информация о типе

# ContainerTypeMissingInStaticData
source: container type '{0}' is missing in static data
ru_ru: тип контейнера '{0}' отсутствует в статических данных

source: error
ru_ru: Ошибка

source: error getting type for part
ru_ru: ошибка получения типа для детали

# ErrorInvoceNumberCustomsClearance
source: error in generating the invoice number for the customs clearance
ru_ru: ошибка при формировании номера счета-фактуры для таможенного оформления

# ErrorsInFile
source: there are errors that prevent further continuation, correct the errors in the file '{0}'
ru_ru: есть ошибки, препятствующие дальнейшему продолжению, исправьте ошибки в файле '{0}'

# FinalLocationNotFound
source: the final location was not found when generating tracing
ru_ru: конечное местоположение не было найдено при создании трейсинга

# InvoiceNumberHasBeenUploaded
source: document with invoice number '{0}' has already been uploaded
ru_ru: документ с номером счета-фактуры '{0}' уже загружен

# NotValidVIN
source: not valid VIN '{0}'
ru_ru: недействительный вин-код '{0}'

# PackingTypeMissingInStaticData
source: packing type '{0}' is missing in static data
ru_ru: тип упаковки '{0}' отсутствует в статических данных

# PartByNumberNotFound
source: part by number '{0}' not found
ru_ru: деталь по номеру '{0}' не найдена

# Partner2GetAllTracing
source: start of get data to partner 2 to export file
ru_ru: начало получения данных партнера 2 для экспорта файла

# PartNumberDifferentPrice
source: part number '{0}' has different prices
ru_ru: номер детали '{0}' имеет разные цены

source: Please wait
ru_ru: Пожалуйста подождите

# PriceByPartNumberNotFound
source: price by part number '{0}' not found
ru_ru: цена по номеру детали '{0}' не найдена

# QuantityByPartNumberNotFound
source: quantity by part number '{0}' not found
ru_ru: количество по номеру детали '{0}' не найдено

# ReleaseNotFound
source: Release not found for body '{0}', check the correctness of the input or contact the DSS
ru_ru: Релиз не найден для тела '{0}', проверьте правильность ввода или обратитесь в DSS.

# SavingProgressCase
source: saving a case to the {0} from {1}
ru_ru: сохранение кейса {0} из {1}

# SavingProgressContainer
source: saving a container to the {0} from {1}
ru_ru: сохранение контейнера {0} из {1}

# SavingProgressCustomsClearance
source: saving a customs clearance to the {0} from {1}
ru_ru: сохранение таможенной очистки {0} из {1}

# SavingProgressCustomsPart
source: saving a customs part to the {0} from {1}
ru_ru: сохранение таможенной детали {0} из {1}

# SavingProgressDetailInContainer
source: saving a detail to the container {0} from {1}
ru_ru: сохранение детали в контейнер {0} из {1}

# SavingProgressPartInInvoice
source: saving a part in invoice to the {0} from {1}
ru_ru: сохранение детали в инвойс {0} из {1}

# SavingProgressTracing
source: saving a tracing to the {0} from {1}
ru_ru: сохранение трейсинга {0} из {1}

# SavingProgressVinContainer
source: saving a vin container to the {0} from {1}
ru_ru: сохранение вин контейнера {0} из {1}
